Repository: DavidS/MigraDoc
Catalog: MigraDoc/code/MigraDoc.DocumentObjectModel/MigraDoc.DocumentObjectModel.Resources/Messages.*.resx
Languages: de

# IdentifierExpected
source: Identifier expected: '{0}'.
de: Bezeichner erwartet: '{0}'.

# NewlineInString
source: Newline in string not allowed.
de: Zeilenumbruch in Zeichenkette nicht erlaubt.

source: End of file expected.
de: Ende der Datei erwartet.

# InvalidEnumForLeftPosition
source: ShapePosition must be Left, Center, or Right.
de: ShapePosition muss einer der Werte 'Left', 'Center', oder 'Right' sein.

# UseOfUndefinedBaseStyle
source: Use of undefined base style '{0}'.
de: Die unbekannte Basis-Formatvorlage '{0}' wurde verwendet.

# UnexpectedSymbol
source: Unexpected symbol '{0}'.
de: Unerwartetes Symbol '{0}'.

# NullAssignmentNotSupported
source: Assign 'null' to '{0}' not allowed.
de: Zuweisung von 'null' an '{0}' ist nicht erlaubt.

# OutOfRange
source: Valid range only within '{0}'.
de: Der gültige Bereich liegt innerhalb von '{0}'.

# InvalidColorString
source: Color could not be parsed from string '{0}'.
de: Aus der Zeichenkette '{0}' konnte keine Farbe eingelesen werden.

# MissingBracketRight
source: Missing right bracket after '{0}'.
de: Schließende eckige Klammer nach '{0}' fehlt.

# MissingObligatoryProperty
source: Obigatory property '{0}' not set in '{1}'.
de: Obigatorische Eigenschaft '{0}' wurde an '{1}' nicht gesetzt.

# InvalidFieldType
source: Invalid field type: '{0}'.
de: Ungültiger Feldtyp: '{0}'.

# NullExpected
source: Null expected: '{0}'.
de: Null erwartet: '{0}'.

# InvalidType
source: Variable type '{0}' not supported by '{1}'.
de: Variablentyp '{0}' wird von '{1}' nicht unterstützt.

# EmptyBaseStyle
source: Attempt to set empty base style is invalid.
de: Die Basis-Formatvorlage darf nicht leer sein.

# UndefinedBaseStyle
source: Base style name '{0}' is undefined.
de: Die Basis-Formatvorlage '{0}' ist nicht definiert.

# InvalidEnumForTopPosition
source: ShapePosition must be Top, Center, or Bottom.
de: ShapePosition einer der Werte 'Top', 'Center', oder 'Bottom' sein.

# MissingBraceRight
source: Missing right brace after '{0}'.
de: Schließende geschweifte Klammer nach '{0}' fehlt.

# SymbolNotAllowed
source: Symbol '{0}' in this context not allowed.
de: Symbol '{0}' ist in diesem Zusammenhang nichterlaubt.

# UnknownChartType
source: Unknown chart type: '{0}'
de: Unbekannter Diagrammtyp: '{0}'

# NoAccess
source: Access denied: '{0}' for internal use only.
de: Zugriff verweigert: '{0}' existiert nur für den internen Gebrauch.

# MissingBracketLeft
source: Missing left bracket after '{0}'.
de: Öffnende eckige Klammer nach '{0}' fehlt.

# SymbolIsNotAnObject
source: Symbol '{0}' is not an object.
de: Symbol '{0}' ist kein Objekt.

# BaseStyleRequired
source: Base style name must be defined.
de: Es muss eine Basis-Formatvorlage definiert werden.

# SymbolsExpected
source: One of the following symbols {0} is expected.
de: Eines der folgenden Symbole {0} erwartet.

# InvalidSymbolType
source: Symbol not valid '{0}'.
de: Ungültiges Symbol '{0}'.

# RealExpected
source: Real expected: '{0}'.
de: Fließkomma-Wert erwartet: '{0}'.

# StringExpected
source: String expected: '{0}'.
de: Zeichenkette erwartet: '{0}'.

# MissingParenRight
source: Missing right parenthesis after '{0}'.
de: Schließende runde Klammer nach '{0}' fehlt.

# InvalidFontSize
source: The font size '{0}' is out of range.
de: Die Fontgröße '{0}' is ausserhalb des erlaubten Bereichs.

# NumberExpected
source: Number expected: '{0}'.
de: Zahl erwartet: '{0}'.

# InvalidFieldFormat
source: '{0}' is not a valid numeric field format.
de: '{0}' ist kein gültiges Format für ein numerisches Feld.

# UseOfUndefinedStyle
source: Use of undefined style '{0}'.
de: Die unbekannte Formatvorlage '{0}' wurde verwendet.

# MissingParenLeft
source: Missing left parenthesis after '{0}'.
de: Öffnende runde Klammer nach '{0}' fehlt.

# InvalidInfoFieldName
source: Property 'Name' of 'InfoField' has invalid value '{0}'.
de: Die Eigenschaft 'Name' an 'InfoField' hat den ungültigen Wert '{0}'.

# InvalidUnitType
source: '{0}' is an unknown unit type.
de: '{0}' ist ein unbekannter Maß für ein 'Unit'-Objekt.

# ParentAlreadySet
source: Value of type '{0}' must be cloned before set into '{1}'.
de: Wert vom Typ '{0}' muss geklont werden, bevor we an '{1}' gesetzt werden kann.

# EscapeSequenceNotAllowed
source: Invalid escape sequence.
de: Ungültige Escapesequenz.

# KeyWordExpected
source: '{1}' - '{0}' expected.
de: Schlüsselwort '{1}' - '{0}' erwartet.

# IntegerExpected
source: Integer expected: '{0}'.
de: Ganze Zahl erwartet: '{0}'.

# InvalidRange
source: Invalid range: '{0}'.
de: Ungültiger Bereich: '{0}'.

# InvalidColor
source: Invalid color: '{0}'.
de: Ungültiger Farbwert: '{0}'.

# BoolExpected
source: Bool expected: '{0}'.
de: Boolescher Wert erwartet: '{0}'.

# OperatorExpected
source: Syntax error: Operator '{0}' is expected.
de: Syntaxfehler: Operator '{0}' erwartet.

# InvalidDocumentObjectType
source: The given document object is not valid in this context.
de: Das übergebene Dokumentobjekt ist in diesem Zusammenhang nicht gültig.

# InsertNullNotAllowed
source: Inserting null into a collection is not allowed.
de: In ein Collection-Objekt darf keine null eingefügt werden.

# StyleNameExpected
source: Invalid style name '{0}'.
de: '{0}' ist kein gültiger Name für eine Formatvorlage.

# SymbolExpected
source: '{0}' expected, found '{1}'.
de: Symbol '{0}' erwartet, '{1}' vorgefunden.

# MissingBraceLeft
source: Missing left brace after '{0}'.
de: Öffnende geschweifte Klammer nach '{0}' fehlt.

# InvalidUnitValue
source: String '{0}' is not a valid value for structure 'Unit'.
de: '{0}' ist keine gültige Zeichenkette für ein 'Unit'-Objekt.

# StyleExpected
source: The value must be of type MigraDoc.DocumentObjectModel.Style.
de: Der übergebene Wert muss vom Typ MigraDoc.DocumentObjectModel.Style sein.

# InvalidValueForOperation
source: Operation '{1}' not valid for Value '{0}'.
de: Operation '{1}' ist für den Wert '{0}' nicht gültig.

source: Missing comma.
de: Komma fehlt.

source: Unexpected end of file.
de: Unerwartetes Dateiende.

# InvalidAssignment
source: Invalid assignment to '{0}'.
de: Ungültige Zuweisung an '{0}'.

# InvalidValueName
source: Invalid value name: '{0}'.
de: '{0}' ist ein ungültiger Wertname.
